benchmark/leveldb/results/micro/mris_ran_wt_ssd.3.log
LevelDB:    version 1.5
Date:       Wed Dec 12 18:23:52 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_ran_wt  :    2159.008 micros/op;   30.8 MB/s
Microseconds per op:
Count: 20000  Average: 2158.6334  StdDev: 23199.68
Min: 115.0000  Median: 659.8266  Max: 1019456.0000
------------------------------------------------------
[     100,     120 )     176   0.880%   0.880% 
[     120,     140 )    8575  42.875%  43.755% #########
[     140,     160 )     826   4.130%  47.885% #
[     160,     180 )      61   0.305%  48.190% 
[     180,     200 )      42   0.210%  48.400% 
[     200,     250 )      11   0.055%  48.455% 
[     250,     300 )      45   0.225%  48.680% 
[     300,     350 )       4   0.020%  48.700% 
[     350,     400 )      31   0.155%  48.855% 
[     400,     450 )      13   0.065%  48.920% 
[     450,     500 )       9   0.045%  48.965% 
[     600,     700 )     346   1.730%  50.695% 
[     700,     800 )     596   2.980%  53.675% #
[     800,     900 )    2033  10.165%  63.840% ##
[     900,    1000 )     167   0.835%  64.675% 
[    1000,    1200 )     712   3.560%  68.235% #
[    1200,    1400 )     393   1.965%  70.200% 
[    1400,    1600 )      85   0.425%  70.625% 
[    1600,    1800 )     333   1.665%  72.290% 
[    1800,    2000 )    2352  11.760%  84.050% ##
[    2000,    2500 )    1265   6.325%  90.375% #
[    2500,    3000 )     143   0.715%  91.090% 
[    3000,    3500 )     102   0.510%  91.600% 
[    3500,    4000 )      62   0.310%  91.910% 
[    4000,    4500 )     230   1.150%  93.060% 
[    4500,    5000 )     538   2.690%  95.750% #
[    5000,    6000 )     624   3.120%  98.870% #
[    6000,    7000 )      90   0.450%  99.320% 
[    7000,    8000 )      44   0.220%  99.540% 
[    8000,    9000 )      27   0.135%  99.675% 
[    9000,   10000 )      10   0.050%  99.725% 
[   10000,   12000 )       1   0.005%  99.730% 
[   12000,   14000 )       2   0.010%  99.740% 
[   14000,   16000 )       1   0.005%  99.745% 
[   16000,   18000 )       1   0.005%  99.750% 
[   20000,   25000 )       1   0.005%  99.755% 
[   50000,   60000 )       2   0.010%  99.765% 
[   90000,  100000 )       1   0.005%  99.770% 
[  100000,  120000 )       3   0.015%  99.785% 
[  160000,  180000 )       2   0.010%  99.795% 
[  180000,  200000 )       1   0.005%  99.800% 
[  200000,  250000 )       4   0.020%  99.820% 
[  250000,  300000 )       2   0.010%  99.830% 
[  300000,  350000 )       2   0.010%  99.840% 
[  350000,  400000 )       1   0.005%  99.845% 
[  400000,  450000 )       1   0.005%  99.850% 
[  450000,  500000 )       4   0.020%  99.870% 
[  500000,  600000 )      20   0.100%  99.970% 
[  600000,  700000 )       4   0.020%  99.990% 
[  700000,  800000 )       1   0.005%  99.995% 
[ 1000000, 1200000 )       1   0.005% 100.000% 

----- /mnt/largespace/mris_ran_wt_db statistics: -----
nr_new_large_values_ 	9982
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0