benchmark/leveldb/results/micro/mris_seq_wt_hybrid.2.log
LevelDB:    version 1.5
Date:       Sat Dec  1 15:45:53 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
./table/mris.h:637: [mris] Failed to open /mnt/largespace/mris_seq_wt_db
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
----- /mnt/largespace/mris_seq_wt_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0
mris_seq_wt  :    2143.014 micros/op;   31.0 MB/s
Microseconds per op:
Count: 20000  Average: 2142.6519  StdDev: 8932.92
Min: 119.0000  Median: 680.1310  Max: 222883.0000
------------------------------------------------------
[     100,     120 )       1   0.005%   0.005% 
[     120,     140 )    8256  41.280%  41.285% ########
[     140,     160 )     953   4.765%  46.050% #
[     160,     180 )     122   0.610%  46.660% 
[     180,     200 )     234   1.170%  47.830% 
[     200,     250 )      62   0.310%  48.140% 
[     250,     300 )       1   0.005%  48.145% 
[     300,     350 )       1   0.005%  48.150% 
[     350,     400 )       2   0.010%  48.160% 
[     450,     500 )       1   0.005%  48.165% 
[     600,     700 )     458   2.290%  50.455% 
[     700,     800 )    1134   5.670%  56.125% #
[     800,     900 )    3938  19.690%  75.815% ####
[     900,    1000 )     258   1.290%  77.105% 
[    1000,    1200 )     796   3.980%  81.085% #
[    1200,    1400 )     683   3.415%  84.500% #
[    1400,    1600 )     192   0.960%  85.460% 
[    1600,    1800 )      35   0.175%  85.635% 
[    1800,    2000 )      11   0.055%  85.690% 
[    2000,    2500 )      62   0.310%  86.000% 
[    2500,    3000 )      37   0.185%  86.185% 
[    3000,    3500 )      30   0.150%  86.335% 
[    3500,    4000 )      50   0.250%  86.585% 
[    4000,    4500 )     375   1.875%  88.460% 
[    4500,    5000 )    1102   5.510%  93.970% #
[    5000,    6000 )     671   3.355%  97.325% #
[    6000,    7000 )     130   0.650%  97.975% 
[    7000,    8000 )      56   0.280%  98.255% 
[    8000,    9000 )      22   0.110%  98.365% 
[    9000,   10000 )       5   0.025%  98.390% 
[   50000,   60000 )      45   0.225%  98.615% 
[   60000,   70000 )     187   0.935%  99.550% 
[   70000,   80000 )      64   0.320%  99.870% 
[   80000,   90000 )      10   0.050%  99.920% 
[   90000,  100000 )       4   0.020%  99.940% 
[  100000,  120000 )       7   0.035%  99.975% 
[  120000,  140000 )       1   0.005%  99.980% 
[  140000,  160000 )       1   0.005%  99.985% 
[  160000,  180000 )       1   0.005%  99.990% 
[  180000,  200000 )       1   0.005%  99.995% 
[  200000,  250000 )       1   0.005% 100.000%