benchmark/leveldb/results/micro/mris_seq_wt_hybrid.3.log
LevelDB:    version 1.5
Date:       Sat Dec  1 15:46:38 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
./table/mris.h:637: [mris] Failed to open /mnt/largespace/mris_seq_wt_db
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
----- /mnt/largespace/mris_seq_wt_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0
mris_seq_wt  :    2165.032 micros/op;   30.7 MB/s
Microseconds per op:
Count: 20000  Average: 2164.6843  StdDev: 9240.42
Min: 120.0000  Median: 678.8155  Max: 239477.0000
------------------------------------------------------
[     120,     140 )    8396  41.980%  41.980% ########
[     140,     160 )     859   4.295%  46.275% #
[     160,     180 )      88   0.440%  46.715% 
[     180,     200 )     236   1.180%  47.895% 
[     200,     250 )      67   0.335%  48.230% 
[     250,     300 )       6   0.030%  48.260% 
[     300,     350 )       2   0.010%  48.270% 
[     600,     700 )     439   2.195%  50.465% 
[     700,     800 )    1122   5.610%  56.075% #
[     800,     900 )    3979  19.895%  75.970% ####
[     900,    1000 )     239   1.195%  77.165% 
[    1000,    1200 )     770   3.850%  81.015% #
[    1200,    1400 )     709   3.545%  84.560% #
[    1400,    1600 )     185   0.925%  85.485% 
[    1600,    1800 )      25   0.125%  85.610% 
[    1800,    2000 )      14   0.070%  85.680% 
[    2000,    2500 )      63   0.315%  85.995% 
[    2500,    3000 )      46   0.230%  86.225% 
[    3000,    3500 )      37   0.185%  86.410% 
[    3500,    4000 )      49   0.245%  86.655% 
[    4000,    4500 )     342   1.710%  88.365% 
[    4500,    5000 )    1123   5.615%  93.980% #
[    5000,    6000 )     642   3.210%  97.190% #
[    6000,    7000 )     132   0.660%  97.850% 
[    7000,    8000 )      74   0.370%  98.220% 
[    8000,    9000 )      29   0.145%  98.365% 
[    9000,   10000 )       5   0.025%  98.390% 
[   50000,   60000 )      42   0.210%  98.600% 
[   60000,   70000 )     201   1.005%  99.605% 
[   70000,   80000 )      50   0.250%  99.855% 
[   80000,   90000 )      10   0.050%  99.905% 
[   90000,  100000 )       3   0.015%  99.920% 
[  100000,  120000 )       9   0.045%  99.965% 
[  140000,  160000 )       1   0.005%  99.970% 
[  160000,  180000 )       1   0.005%  99.975% 
[  180000,  200000 )       2   0.010%  99.985% 
[  200000,  250000 )       3   0.015% 100.000%