benchmark/leveldb/results/micro/mris_seq_wt_hybrid.3.log
LevelDB:    version 1.5
Date:       Wed Dec 12 18:28:38 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_seq_wt  :    1865.742 micros/op;   35.6 MB/s
Microseconds per op:
Count: 20000  Average: 1865.5147  StdDev: 27541.80
Min: 114.0000  Median: 616.9014  Max: 1000482.0000
------------------------------------------------------
[     100,     120 )     201   1.005%   1.005% 
[     120,     140 )    8773  43.865%  44.870% #########
[     140,     160 )     751   3.755%  48.625% #
[     160,     180 )      63   0.315%  48.940% 
[     180,     200 )      30   0.150%  49.090% 
[     200,     250 )       7   0.035%  49.125% 
[     250,     300 )       3   0.015%  49.140% 
[     300,     350 )       5   0.025%  49.165% 
[     350,     400 )      24   0.120%  49.285% 
[     400,     450 )       5   0.025%  49.310% 
[     450,     500 )       5   0.025%  49.335% 
[     500,     600 )       1   0.005%  49.340% 
[     600,     700 )     781   3.905%  53.245% #
[     700,     800 )    1070   5.350%  58.595% #
[     800,     900 )    4128  20.640%  79.235% ####
[     900,    1000 )     162   0.810%  80.045% 
[    1000,    1200 )     944   4.720%  84.765% #
[    1200,    1400 )     634   3.170%  87.935% #
[    1400,    1600 )      53   0.265%  88.200% 
[    1600,    1800 )      22   0.110%  88.310% 
[    1800,    2000 )      30   0.150%  88.460% 
[    2000,    2500 )      27   0.135%  88.595% 
[    2500,    3000 )      57   0.285%  88.880% 
[    3000,    3500 )      83   0.415%  89.295% 
[    3500,    4000 )      56   0.280%  89.575% 
[    4000,    4500 )     171   0.855%  90.430% 
[    4500,    5000 )     404   2.020%  92.450% 
[    5000,    6000 )    1102   5.510%  97.960% #
[    6000,    7000 )     263   1.315%  99.275% 
[    7000,    8000 )      86   0.430%  99.705% 
[    8000,    9000 )      26   0.130%  99.835% 
[    9000,   10000 )       9   0.045%  99.880% 
[   10000,   12000 )       2   0.010%  99.890% 
[   12000,   14000 )       1   0.005%  99.895% 
[   50000,   60000 )       1   0.005%  99.900% 
[  200000,  250000 )       1   0.005%  99.905% 
[  700000,  800000 )       1   0.005%  99.910% 
[  800000,  900000 )       9   0.045%  99.955% 
[  900000, 1000000 )       8   0.040%  99.995% 
[ 1000000, 1200000 )       1   0.005% 100.000% 

----- /mnt/largespace/mris_seq_wt_db statistics: -----
nr_new_large_values_ 	9982
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0