benchmark/leveldb/results/micro/mris_seq_wt_sata.1.log
LevelDB:    version 1.5
Date:       Wed Dec 12 17:59:18 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_seq_wt  :    1882.977 micros/op;   35.3 MB/s
Microseconds per op:
Count: 20000  Average: 1882.6008  StdDev: 27752.95
Min: 115.0000  Median: 625.8890  Max: 1013031.0000
------------------------------------------------------
[     100,     120 )      19   0.095%   0.095% 
[     120,     140 )    8856  44.280%  44.375% #########
[     140,     160 )     833   4.165%  48.540% #
[     160,     180 )      30   0.150%  48.690% 
[     180,     200 )      24   0.120%  48.810% 
[     200,     250 )       6   0.030%  48.840% 
[     250,     300 )       1   0.005%  48.845% 
[     300,     350 )       2   0.010%  48.855% 
[     350,     400 )      14   0.070%  48.925% 
[     400,     450 )      10   0.050%  48.975% 
[     450,     500 )      16   0.080%  49.055% 
[     500,     600 )       7   0.035%  49.090% 
[     600,     700 )     703   3.515%  52.605% #
[     700,     800 )    1195   5.975%  58.580% #
[     800,     900 )    4200  21.000%  79.580% ####
[     900,    1000 )     173   0.865%  80.445% 
[    1000,    1200 )     976   4.880%  85.325% #
[    1200,    1400 )     499   2.495%  87.820% 
[    1400,    1600 )      74   0.370%  88.190% 
[    1600,    1800 )      31   0.155%  88.345% 
[    1800,    2000 )      22   0.110%  88.455% 
[    2000,    2500 )      48   0.240%  88.695% 
[    2500,    3000 )      64   0.320%  89.015% 
[    3000,    3500 )      80   0.400%  89.415% 
[    3500,    4000 )      81   0.405%  89.820% 
[    4000,    4500 )     166   0.830%  90.650% 
[    4500,    5000 )     385   1.925%  92.575% 
[    5000,    6000 )    1051   5.255%  97.830% #
[    6000,    7000 )     290   1.450%  99.280% 
[    7000,    8000 )      80   0.400%  99.680% 
[    8000,    9000 )      29   0.145%  99.825% 
[    9000,   10000 )       7   0.035%  99.860% 
[   10000,   12000 )       6   0.030%  99.890% 
[   12000,   14000 )       1   0.005%  99.895% 
[  200000,  250000 )       1   0.005%  99.900% 
[  400000,  450000 )       1   0.005%  99.905% 
[  600000,  700000 )       1   0.005%  99.910% 
[  800000,  900000 )      12   0.060%  99.970% 
[  900000, 1000000 )       4   0.020%  99.990% 
[ 1000000, 1200000 )       2   0.010% 100.000% 

----- /mnt/largespace/mris_seq_wt_db statistics: -----
nr_new_large_values_ 	9982
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0